//- Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
//(в першу, другу, третю или четверту частину години).
let time = +prompt('Введіть хвилини від 0 до 59:');
if(time >= 0 && time < 15) {
    console.log('Перша частина години!');
}else if(time >= 15 && time < 30) {
    console.log('Друга частина години!');
}else if(time >= 30 && time < 45) {
    console.log('Третя частина години!');
}else if(time >= 45 && time < 60) {
    console.log('Четверта частина години!');
} else {
    console.log('Error!!!')
}






//- У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).

let day = +prompt('Введіть день місяця:');
if (day > 0 && day <= 10 ){
    console.log('Перша декада');
} else if (day > 10 && day <=20 ){
    console.log('Друга декада');
} else if (day > 20 && day <=31 ){
    console.log('Третя декада');
} else {
    console.log('Error!!!');
}




//- У нас є змінна test, якщо  не дорівнює true, виведіть 'Вірно', інакше виведіть 'Неправильно'.
//    Перевірте роботу скрипта при test, що дорівнює true, false. Напишіть два варіанти скрипта - з коротким записом(тернаркою)
let test = 'qwerty';
if (test === true) {
    console.log('Вірно');
} else {
    console.log('Неправильно');
}
// =============================Тернарка ============================
// (test === true) ? console.log('Вірно') : console.log('Неправильно');





//- Якщо змінна a не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

let a = +prompt('Введіть число -3, 0 або 1:');
if (a !== 0){
    console.log('Вірно!');
} else {
    console.log('Невірно!');
}



//- Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа що заплановано на цей день.
let dayOfWeek = +prompt('Введіть порядковий номер дня тижня від 1 до 7:');
switch (dayOfWeek) {
    case 1:
        console.log('Понеділок: сходити за продуктами!');
        break;
    case 2:
        console.log('Вівторок: поїхати на дачу!');
        break;
    case 3:
        console.log('Середа: погуляти з собакою!');
        break;
    case 4:
        console.log('Четвер: піти до спортивної зали!');
        break;
    case 5:
        console.log('Пятниця: заправити авто!');
        break;
    case 6:
        console.log('Субота: прибрати у будинку/квартирі!');
        break;
    case 7:
        console.log('Неділя: можна відпочити!');
        break;
    default:
        console.log('Error!!!');
}



//- Потрібно визначити Високосний рік чи ні. Високосні роки діляться націло на 4.

let year = +prompt('Введіть рік:');
if(year % 4 === 0){
    console.log('Рік Високосний!');
}else {
    console.log('Звичайний рік!');
}




//- Використовуючи конструкцію if..else, напишіть код, який запитуватиме: „Яка «офіційна» назва JavaScript?“
//Якщо користувач вводить «ECMAScript», то показати: «Правильно!», інакше – відобразити: «Не знаєте? ECMAScript!
let jsName = prompt('Яка «офіційна» назва JavaScript?');
if (jsName === 'ECMAScript'){
    console.log('Правильно!');
} else {
    console.log('Не знаєте? ECMAScript!');
}