//- Користувач вводить або має два числа.
//    Потрібно знайти та вивести максимальне число з тих двох .
//    Також потрібно врахувати коли введені рівні числа.
let number1 = +prompt('Введіть перше число:');
let number2 = +prompt('Введіть друге число:');
if ( number1 > number2){
    console.log('Перше число більше!', '---', number1);
} else if ( number1 < number2){
    console.log('Друге число більше!', '---', number2);
} else if ( number1 === number2 ) {
    console.log('Числа між собою рівні!', number1, '---', number2);
} else {
    console.log('Невірно введені дані!!!');
}



//- У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
//Користувач вводить номер квартири просто в змінні або через prompt('') .
//    Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.
let apartmentNumber = +prompt('Введіть номер квартири з 1 по 90:');
if (apartmentNumber >=1 && apartmentNumber <=20){
    console.log('Квартира знаходиться у першому підїзді!');
}
else if (apartmentNumber >=21 && apartmentNumber <=48){
    console.log('Квартира знаходиться у другому підїзді!');
}
else if (apartmentNumber >=49 && apartmentNumber <=90){
    console.log('Квартира знаходиться у третьому підїзді!');
} else {
    console.log('Невірно введено дані!!!');
}


//- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО
let number = +prompt('Введіть число 10:');
if (number === 10){
    console.log('Вірно!');
} else {
    console.log('Невірно!');
}




//- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
//    якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 3.
//якщо в змінну записали щось інше, спрацьовує else
let x = prompt('Щось введіть:');
if (typeof x === 'number' ){
    console.log('1 - number');
}
else if (typeof x === 'string' ){
    console.log('2 - string');
}
else if (typeof x === 'boolean' ){
    console.log('3 - boolean');
} else if (typeof x === 'object') {
    console.log('4 - object')
} else {
    console.log('Ой! Щось не так 0_о!')
}




//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
//    Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
//    Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН
let tOkten = +prompt('Чи ми йдемо сььогодні в OKTEN на навчяання? Введіть температуру:');
if (tOkten >= 10 && tOkten <= 22){
    console.log('Ураааа! Ми йдемо ВЧИТИСЯ!');
} else if (tOkten < 10 && tOkten > 22) {
    console.log('Сидимо вдома і навчаємося ОНЛАЙН!');
} else {
    console.log('О ні! Дані введено не коректно!');
}





//- За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//    числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let games = +prompt('ВІКТОРИНА!!! Введіть число від 1 до 5:');
switch (games){
    case 1:
        console.log('Вітаю!!! Ваш приз автомобіль!);
        break;
    case 2:
        console.log('Вітаю!!! Ваш приз мотоцикл!);
        break;
    case 3:
        console.log('Вітаю!!! Ваш приз катер!);
        break;
    case 4:
        console.log('Вітаю!!! Ваш приз квартира!);
        break;
    case 5:
        console.log('Вітаю!!! Ваш приз смартвон!);
        break;
    default:
        console.log('Число не вірне!!!');
}


